stm32duino/LSM6DSO/src/lsm6dso_reg.h
int32_t lsm6dso_pin_int2_route_set(lsm6dso_ctx_t *ctx, lsm6dso_ctx_t *aux_ctx,
                                   lsm6dso_pin_int2_route_t val);
int32_t lsm6dso_pin_int2_route_get(lsm6dso_ctx_t *ctx, lsm6dso_ctx_t *aux_ctx,
                                   lsm6dso_pin_int2_route_t *val);

typedef struct {
  uint8_t drdy_xl          :  1; /* Accelerometer data ready */
  uint8_t drdy_g           :  1; /* Gyroscope data ready */
  uint8_t drdy_temp        :  1; /* Temperature data ready */
  uint8_t den_flag         :  1; /* external trigger level recognition (DEN) */
  uint8_t timestamp        :  1; /* timestamp overflow (1 = int2 pin disable) */
  uint8_t free_fall        :  1; /* free fall event */
  uint8_t wake_up          :  1; /* wake up event */
  uint8_t wake_up_z        :  1; /* wake up on Z axis event */
  uint8_t wake_up_y        :  1; /* wake up on Y axis event */
  uint8_t wake_up_x        :  1; /* wake up on X axis event */
  uint8_t single_tap       :  1; /* single-tap event */
  uint8_t double_tap       :  1; /* double-tap event */
  uint8_t tap_z            :  1; /* single-tap on Z axis event */
  uint8_t tap_y            :  1; /* single-tap on Y axis event */
  uint8_t tap_x            :  1; /* single-tap on X axis event */
  uint8_t tap_sign         :  1; /* sign of tap event (0-pos / 1-neg) */
  uint8_t six_d            :  1; /* orientation change (6D/4D detection) */
  uint8_t six_d_xl         :  1; /* X-axis low 6D/4D event (under threshold) */
  uint8_t six_d_xh         :  1; /* X-axis high 6D/4D event (over threshold) */
  uint8_t six_d_yl         :  1; /* Y-axis low 6D/4D event (under threshold) */
  uint8_t six_d_yh         :  1; /* Y-axis high 6D/4D event (over threshold) */
  uint8_t six_d_zl         :  1; /* Z-axis low 6D/4D event (under threshold) */
  uint8_t six_d_zh         :  1; /* Z-axis high 6D/4D event (over threshold) */
  uint8_t sleep_change     :  1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t sleep_state      :  1; /* Act/Inact status flag (0-Act / 1-Inact) */
  uint8_t step_detector    :  1; /* Step detected */
  uint8_t tilt             :  1; /* Relative tilt event detected */
  uint8_t sig_mot          :  1; /* "significant motion" event detected */
  uint8_t fsm_lc           :  1; /* fsm long counter timeout interrupt event */
  uint8_t fsm1             :  1; /* fsm 1 interrupt event */
  uint8_t fsm2             :  1; /* fsm 2 interrupt event */
  uint8_t fsm3             :  1; /* fsm 3 interrupt event */
  uint8_t fsm4             :  1; /* fsm 4 interrupt event */
  uint8_t fsm5             :  1; /* fsm 5 interrupt event */
  uint8_t fsm6             :  1; /* fsm 6 interrupt event */
  uint8_t fsm7             :  1; /* fsm 7 interrupt event */
  uint8_t fsm8             :  1; /* fsm 8 interrupt event */
  uint8_t fsm9             :  1; /* fsm 9 interrupt event */
  uint8_t fsm10            :  1; /* fsm 10 interrupt event */
  uint8_t fsm11            :  1; /* fsm 11 interrupt event */
  uint8_t fsm12            :  1; /* fsm 12 interrupt event */
  uint8_t fsm13            :  1; /* fsm 13 interrupt event */
  uint8_t fsm14            :  1; /* fsm 14 interrupt event */
  uint8_t fsm15            :  1; /* fsm 15 interrupt event */
  uint8_t fsm16            :  1; /* fsm 16 interrupt event */
  uint8_t mlc1             :  1; /* mlc 1 interrupt event */
  uint8_t mlc2             :  1; /* mlc 2 interrupt event */
  uint8_t mlc3             :  1; /* mlc 3 interrupt event */
  uint8_t mlc4             :  1; /* mlc 4 interrupt event */
  uint8_t mlc5             :  1; /* mlc 5 interrupt event */
  uint8_t mlc6             :  1; /* mlc 6 interrupt event */
  uint8_t mlc7             :  1; /* mlc 7 interrupt event */
  uint8_t mlc8             :  1; /* mlc 8 interrupt event */
  uint8_t sh_endop         :  1; /* sensor hub end operation */
  uint8_t sh_slave0_nack   :  1; /* Not acknowledge on sensor hub slave 0 */
  uint8_t sh_slave1_nack   :  1; /* Not acknowledge on sensor hub slave 1 */
  uint8_t sh_slave2_nack   :  1; /* Not acknowledge on sensor hub slave 2 */
  uint8_t sh_slave3_nack   :  1; /* Not acknowledge on sensor hub slave 3 */
  uint8_t sh_wr_once       :  1; /* "WRITE_ONCE" end on sensor hub slave 0 */
  uint16_t fifo_diff       : 10; /* Number of unread sensor data in FIFO*/
  uint8_t fifo_ovr_latched :  1; /* Latched FIFO overrun status */
  uint8_t fifo_bdr         :  1; /* FIFO Batch counter threshold reached */
  uint8_t fifo_full        :  1; /* FIFO full */
  uint8_t fifo_ovr         :  1; /* FIFO overrun */
  uint8_t fifo_th          :  1; /* FIFO threshold reached */
} lsm6dso_all_sources_t;
int32_t lsm6dso_all_sources_get(lsm6dso_ctx_t *ctx,
                                lsm6dso_all_sources_t *val);

typedef struct {
  uint8_t odr_fine_tune;
} lsm6dso_dev_cal_t;
int32_t lsm6dso_calibration_get(lsm6dso_ctx_t *ctx, lsm6dso_dev_cal_t *val);

typedef struct {
  struct {
    struct {
      enum {
        LSM6DSO_XL_UI_OFF       = 0x00, /* in power down */
        LSM6DSO_XL_UI_1Hz6_LP   = 0x1B, /* @1Hz6 (low power) */
        LSM6DSO_XL_UI_1Hz6_ULP  = 0x2B, /* @1Hz6 (ultra low/Gy, OIS imu off) */
        LSM6DSO_XL_UI_12Hz5_HP  = 0x01, /* @12Hz5 (high performance) */
        LSM6DSO_XL_UI_12Hz5_LP  = 0x11, /* @12Hz5 (low power) */
        LSM6DSO_XL_UI_12Hz5_ULP = 0x21, /* @12Hz5 (ultra low/Gy, OIS imu off) */
        LSM6DSO_XL_UI_26Hz_HP   = 0x02, /* @26Hz  (high performance) */
        LSM6DSO_XL_UI_26Hz_LP   = 0x12, /* @26Hz  (low power) */
        LSM6DSO_XL_UI_26Hz_ULP  = 0x22, /* @26Hz  (ultra low/Gy, OIS imu off) */
        LSM6DSO_XL_UI_52Hz_HP   = 0x03, /* @52Hz  (high performance) */
        LSM6DSO_XL_UI_52Hz_LP   = 0x13, /* @52Hz  (low power) */
        LSM6DSO_XL_UI_52Hz_ULP  = 0x23, /* @52Hz  (ultra low/Gy, OIS imu off) */
        LSM6DSO_XL_UI_104Hz_HP  = 0x04, /* @104Hz (high performance) */
        LSM6DSO_XL_UI_104Hz_NM  = 0x14, /* @104Hz (normal mode) */
        LSM6DSO_XL_UI_104Hz_ULP = 0x24, /* @104Hz (ultra low/Gy, OIS imu off) */
        LSM6DSO_XL_UI_208Hz_HP  = 0x05, /* @208Hz (high performance) */
        LSM6DSO_XL_UI_208Hz_NM  = 0x15, /* @208Hz (normal mode) */
        LSM6DSO_XL_UI_208Hz_ULP = 0x25, /* @208Hz (ultra low/Gy, OIS imu off) */
        LSM6DSO_XL_UI_416Hz_HP  = 0x06, /* @416Hz (high performance) */
        LSM6DSO_XL_UI_833Hz_HP  = 0x07, /* @833Hz (high performance) */
        LSM6DSO_XL_UI_1667Hz_HP = 0x08, /* @1kHz66 (high performance) */
        LSM6DSO_XL_UI_3333Hz_HP = 0x09, /* @3kHz33 (high performance) */
        LSM6DSO_XL_UI_6667Hz_HP = 0x0A, /* @6kHz66 (high performance) */
      } odr;
      enum {
        LSM6DSO_XL_UI_2g   = 0,
        LSM6DSO_XL_UI_4g   = 2,
        LSM6DSO_XL_UI_8g   = 3,
        LSM6DSO_XL_UI_16g  = 1, /* OIS full scale is also forced to be 16g */
      } fs;
    } xl;
    struct {
      enum {
        LSM6DSO_GY_UI_OFF       = 0x00, /* gy in power down */
        LSM6DSO_GY_UI_12Hz5_LP  = 0x11, /* gy @12Hz5 (low power) */
        LSM6DSO_GY_UI_12Hz5_HP  = 0x01, /* gy @12Hz5 (high performance) */
        LSM6DSO_GY_UI_26Hz_LP   = 0x12, /* gy @26Hz  (low power) */
        LSM6DSO_GY_UI_26Hz_HP   = 0x02, /* gy @26Hz  (high performance) */
        LSM6DSO_GY_UI_52Hz_LP   = 0x13, /* gy @52Hz  (low power) */
        LSM6DSO_GY_UI_52Hz_HP   = 0x03, /* gy @52Hz  (high performance) */
        LSM6DSO_GY_UI_104Hz_NM  = 0x14, /* gy @104Hz (low power) */
        LSM6DSO_GY_UI_104Hz_HP  = 0x04, /* gy @104Hz (high performance) */
        LSM6DSO_GY_UI_208Hz_NM  = 0x15, /* gy @208Hz (low power) */
        LSM6DSO_GY_UI_208Hz_HP  = 0x05, /* gy @208Hz (high performance) */
        LSM6DSO_GY_UI_416Hz_HP  = 0x06, /* gy @416Hz (high performance) */
        LSM6DSO_GY_UI_833Hz_HP  = 0x07, /* gy @833Hz (high performance) */
        LSM6DSO_GY_UI_1667Hz_HP = 0x08, /* gy @1kHz66 (high performance) */
        LSM6DSO_GY_UI_3333Hz_HP = 0x09, /* gy @3kHz33 (high performance) */
        LSM6DSO_GY_UI_6667Hz_HP = 0x0A, /* gy @6kHz66 (high performance) */
      } odr;
      enum {
        LSM6DSO_GY_UI_250dps   = 0,
        LSM6DSO_GY_UI_125dps   = 1,
        LSM6DSO_GY_UI_500dps   = 2,
        LSM6DSO_GY_UI_1000dps  = 4,
        LSM6DSO_GY_UI_2000dps  = 6,
      } fs;
    } gy;
  } ui;
  struct {
    enum {
      LSM6DSO_OIS_ONLY_AUX    = 0x00, /* Auxiliary SPI full control */
      LSM6DSO_OIS_MIXED       = 0x01, /* Enabling by UI / read-config by AUX */
    } ctrl_md;
    struct {
      enum {
        LSM6DSO_XL_OIS_OFF       = 0x00, /* in power down */
        LSM6DSO_XL_OIS_6667Hz_HP = 0x01, /* @6kHz OIS imu active/NO ULP on UI */
      } odr;
      enum {
        LSM6DSO_XL_OIS_2g   = 0,
        LSM6DSO_XL_OIS_4g   = 2,
        LSM6DSO_XL_OIS_8g   = 3,
        LSM6DSO_XL_OIS_16g  = 1, /* UI full scale is also forced to be 16g */
      } fs;
    } xl;
    struct {
      enum {
        LSM6DSO_GY_OIS_OFF       = 0x00, /* in power down */
        LSM6DSO_GY_OIS_6667Hz_HP = 0x01, /* @6kHz No Ultra Low Power*/
      } odr;
      enum {
        LSM6DSO_GY_OIS_250dps   = 0,
        LSM6DSO_GY_OIS_125dps   = 1,
        LSM6DSO_GY_OIS_500dps   = 2,
        LSM6DSO_GY_OIS_1000dps  = 4,
        LSM6DSO_GY_OIS_2000dps  = 6,
      } fs;
    } gy;
  } ois;
  struct {
    enum {
      LSM6DSO_FSM_DISABLE = 0x00,
      LSM6DSO_FSM_XL      = 0x01,
      LSM6DSO_FSM_GY      = 0x02,
      LSM6DSO_FSM_XL_GY   = 0x03,
    } sens;
    enum {
      LSM6DSO_FSM_12Hz5 = 0x00,
      LSM6DSO_FSM_26Hz  = 0x01,
      LSM6DSO_FSM_52Hz  = 0x02,
      LSM6DSO_FSM_104Hz = 0x03,
    } odr;
  } fsm;
} lsm6dso_md_t;
int32_t lsm6dso_mode_set(lsm6dso_ctx_t *ctx, lsm6dso_ctx_t *aux_ctx,
                         lsm6dso_md_t *val);
int32_t lsm6dso_mode_get(lsm6dso_ctx_t *ctx, lsm6dso_ctx_t *aux_ctx,
                         lsm6dso_md_t *val);
typedef struct {
  struct {
    struct {
      float mg[3];
      int16_t raw[3];
    } xl;
    struct {
      float mdps[3];
      int16_t raw[3];
    } gy;
    struct {
      float deg_c;
      int16_t raw;
    } heat;
  } ui;
  struct {
    struct {
      float mg[3];
      int16_t raw[3];
    } xl;
    struct {
      float mdps[3];
      int16_t raw[3];
    } gy;
  } ois;
} lsm6dso_data_t;
int32_t lsm6dso_data_get(lsm6dso_ctx_t *ctx, lsm6dso_ctx_t *aux_ctx,
                         lsm6dso_md_t *md, lsm6dso_data_t *data);

typedef struct {
  uint8_t sig_mot      : 1; /* significant motion */
  uint8_t tilt         : 1; /* tilt detection  */
  uint8_t step         : 1; /* step counter/detector */
  uint8_t step_adv     : 1; /* step counter advanced mode */
  uint8_t fsm          : 1; /* finite state machine */
  uint8_t fifo_compr   : 1; /* FIFO compression */
} lsm6dso_emb_sens_t;
int32_t lsm6dso_embedded_sens_set(lsm6dso_ctx_t *ctx,
                                  lsm6dso_emb_sens_t *emb_sens);
int32_t lsm6dso_embedded_sens_get(lsm6dso_ctx_t *ctx,
                                  lsm6dso_emb_sens_t *emb_sens);
int32_t lsm6dso_embedded_sens_off(lsm6dso_ctx_t *ctx);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*LSM6DSO_DRIVER_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
